# Practice notebook for 10 minute with PANDAS library
> **_Author:_** Shahid Umar\
> **_Email:_** shahidumar@mail.com

#### 1. Importing  necessary libraries

In [2]:
import numpy as np
import pandas as pd

#### 2. Creating a object

In [3]:
# For numeric data
object = pd.Series([2, 4, 6, np.nan, 8, 10])
object

0     2.0
1     4.0
2     6.0
3     NaN
4     8.0
5    10.0
dtype: float64

In [4]:
# For Dates
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# Getting random rows and column and create an object
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.979940 -0.758804  1.448193 -0.348777
2013-01-02 -0.282346  1.356334  0.223743 -0.327886
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742
2013-01-04  1.729692 -1.127116  1.765678  0.072982
2013-01-05 -0.305415 -0.306567 -0.788328  0.246994
2013-01-06 -1.839390  0.111913  2.336995  0.149520

In [6]:
# By dictionary
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
# Check different data types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
# Displaying single column's data
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [9]:
# Display all columns in single colum
df2.abs

<bound method NDFrame.abs of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [10]:
# Not fully understand, research required
df2.add

<bound method flex_arith_method_FRAME.<locals>.f of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [11]:
# Not fully understand, research required
#df2.add_prefix()

In [12]:
# Not fully understand, research required
df2.add_suffix

<bound method NDFrame.add_suffix of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [13]:
# Not fully understand, research required
df2.align

<bound method DataFrame.align of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [14]:
# Not fully understand, research required
df2.all

<bound method NDFrame._add_numeric_operations.<locals>.all of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [15]:
# Not fully understand, research required
df2.any

<bound method NDFrame._add_numeric_operations.<locals>.any of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [16]:
# Not fully understand, research required
#df2.append

In [17]:
# Not fully understand, research required
df2.apply

<bound method DataFrame.apply of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [18]:
# Not fully understand, research required
df2.applymap

<bound method DataFrame.applymap of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [19]:
# Not fully understand, research required
df2.bool

<bound method NDFrame.bool of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [20]:
# Not fully understand, research required
df2.boxplot

<bound method boxplot_frame of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [21]:
# Not fully understand, research required
df2.clip

<bound method DataFrame.clip of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [22]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [23]:
df2.copy

<bound method NDFrame.copy of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [24]:
df2.count

<bound method DataFrame.count of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [25]:
df2.combine

<bound method DataFrame.combine of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [26]:
# To show the statistical summary of dataset
df2.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [27]:
df2.diff

<bound method DataFrame.diff of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [28]:
df2.duplicated

<bound method DataFrame.duplicated of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

#### 3. Displaying Data

In [29]:
# Displaying the only first five rows of a dataset
df.head()

                   A         B         C         D
2013-01-01  0.979940 -0.758804  1.448193 -0.348777
2013-01-02 -0.282346  1.356334  0.223743 -0.327886
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742
2013-01-04  1.729692 -1.127116  1.765678  0.072982
2013-01-05 -0.305415 -0.306567 -0.788328  0.246994

In [30]:
# To show the indies of a dataset
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
# Displaying column's name
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [32]:
# Convert the dataframe to numpy array
df.to_numpy()

array([[ 0.97993967, -0.75880366,  1.44819302, -0.34877714],
       [-0.28234642,  1.35633371,  0.22374328, -0.32788576],
       [-0.06119578, -0.29337841, -1.52107324, -0.14874214],
       [ 1.72969162, -1.12711579,  1.76567769,  0.07298156],
       [-0.30541457, -0.3065666 , -0.78832791,  0.24699423],
       [-1.83938969,  0.1119129 ,  2.33699512,  0.14952039]])

In [33]:
# Data types of DataFrame-2
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [34]:
# Convert the dataframe-2 to numpy array
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [35]:
# The statistical summary of a dataset
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.036881 -0.169603  0.577535 -0.059318
std    1.225076  0.860907  1.527111  0.252530
min   -1.839390 -1.127116 -1.521073 -0.348777
25%   -0.299648 -0.645744 -0.535310 -0.283100
50%   -0.171771 -0.299973  0.835968 -0.037880
75%    0.719656  0.010590  1.686307  0.130386
max    1.729692  1.356334  2.336995  0.246994

In [36]:
# Transpose method, rows and columns replace each other
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.979940   -0.282346   -0.061196    1.729692   -0.305415   -1.839390
B   -0.758804    1.356334   -0.293378   -1.127116   -0.306567    0.111913
C    1.448193    0.223743   -1.521073    1.765678   -0.788328    2.336995
D   -0.348777   -0.327886   -0.148742    0.072982    0.246994    0.149520

In [37]:
# Sort the index values, first column normally is index column
df.sort_index(axis=1, ascending=False)
# axis=1 means sorting from min to max and axis=0 means sorting from max to min
# If you place ascending=True then your sorting will be min to max always

                   D         C         B         A
2013-01-01 -0.348777  1.448193 -0.758804  0.979940
2013-01-02 -0.327886  0.223743  1.356334 -0.282346
2013-01-03 -0.148742 -1.521073 -0.293378 -0.061196
2013-01-04  0.072982  1.765678 -1.127116  1.729692
2013-01-05  0.246994 -0.788328 -0.306567 -0.305415
2013-01-06  0.149520  2.336995  0.111913 -1.839390

In [38]:
# Sorting by a specific column
df.sort_values(by="B")

                   A         B         C         D
2013-01-04  1.729692 -1.127116  1.765678  0.072982
2013-01-01  0.979940 -0.758804  1.448193 -0.348777
2013-01-05 -0.305415 -0.306567 -0.788328  0.246994
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742
2013-01-06 -1.839390  0.111913  2.336995  0.149520
2013-01-02 -0.282346  1.356334  0.223743 -0.327886

#### 4a. Selection Procedures `(Getitem ([]))`

In [39]:
# Displaying a single column alongwith index colmun
df["A"]

2013-01-01    0.979940
2013-01-02   -0.282346
2013-01-03   -0.061196
2013-01-04    1.729692
2013-01-05   -0.305415
2013-01-06   -1.839390
Freq: D, Name: A, dtype: float64

In [40]:
# Dispaly rows in range i,e first three rows from index 0 to 2
df[0:3]

                   A         B         C         D
2013-01-01  0.979940 -0.758804  1.448193 -0.348777
2013-01-02 -0.282346  1.356334  0.223743 -0.327886
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742

In [41]:
# Displaying rows in range but according the values of column instead of index number
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.282346  1.356334  0.223743 -0.327886
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742
2013-01-04  1.729692 -1.127116  1.765678  0.072982

#### 4b. Selection Procedure (By Lable)

In [42]:
# Single row displaying and transpose the data (row into column and so on)
df.loc[dates[0]]

A    0.979940
B   -0.758804
C    1.448193
D   -0.348777
Name: 2013-01-01 00:00:00, dtype: float64

In [43]:
# Multiple row displaying 
df.loc[:, ["A", "B"]]
# Here : menas all rows will be displayed

                   A         B
2013-01-01  0.979940 -0.758804
2013-01-02 -0.282346  1.356334
2013-01-03 -0.061196 -0.293378
2013-01-04  1.729692 -1.127116
2013-01-05 -0.305415 -0.306567
2013-01-06 -1.839390  0.111913

In [44]:
# Multiple row displaying with specific range of rows
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.282346  1.356334
2013-01-03 -0.061196 -0.293378
2013-01-04  1.729692 -1.127116

In [45]:
# Displaying a single cell value (i,e A1 or B2)
df.loc[dates[0], "A"]

0.9799396715126676

In [46]:
# 2nd and fast (from above) methode for the aboe output
df.at[dates[0], "A"]
# Here 'at' means fast operation

0.9799396715126676

#### 4c. Selection Procedure (By Position)

In [47]:
# Single row displaying and transpose the data (row into column and so on)
df.iloc[3]

A    1.729692
B   -1.127116
C    1.765678
D    0.072982
Name: 2013-01-04 00:00:00, dtype: float64

In [48]:
# Displaying for specific range of rows and columns 
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.729692 -1.127116
2013-01-05 -0.305415 -0.306567

In [49]:
# Same as above code
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.282346  0.223743
2013-01-03 -0.061196 -1.521073
2013-01-05 -0.305415 -0.788328

In [50]:
# spacific rows range displaying for all columns
df.iloc[1:3, :]
# Here : means displaying all columns

                   A         B         C         D
2013-01-02 -0.282346  1.356334  0.223743 -0.327886
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742

In [51]:
# spacific columns range displaying for all rows
df.iloc[:, 1:3]
# Here : means displaying all rows

                   B         C
2013-01-01 -0.758804  1.448193
2013-01-02  1.356334  0.223743
2013-01-03 -0.293378 -1.521073
2013-01-04 -1.127116  1.765678
2013-01-05 -0.306567 -0.788328
2013-01-06  0.111913  2.336995

In [52]:
# Displaying spacific cell value
df.iloc[1, 1]

1.3563337110088676

In [53]:
# 2nd and fast (from above) methode for the aboe output
df.iat[1, 1]
# Here 'iat' means fast operation

1.3563337110088676

#### 4d. Boolean Indexing

In [54]:
# Displaying only those rows according to column-A which value is greater than zero
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.979940 -0.758804  1.448193 -0.348777
2013-01-04  1.729692 -1.127116  1.765678  0.072982

In [55]:
# Displying only those value of cells which are greater than zero
df[df > 0]
# Here remaining cells will be showing as null becuase above statement is not true for that cells (these are negative values)

                   A         B         C         D
2013-01-01  0.979940       NaN  1.448193       NaN
2013-01-02       NaN  1.356334  0.223743       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  1.729692       NaN  1.765678  0.072982
2013-01-05       NaN       NaN       NaN  0.246994
2013-01-06       NaN  0.111913  2.336995  0.149520

In [56]:
df2 = df.copy() # make a copy of new dataframe
# Explicitly change the values of fifth column by the following command
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.979940 -0.758804  1.448193 -0.348777    one
2013-01-02 -0.282346  1.356334  0.223743 -0.327886    one
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742    two
2013-01-04  1.729692 -1.127116  1.765678  0.072982  three
2013-01-05 -0.305415 -0.306567 -0.788328  0.246994   four
2013-01-06 -1.839390  0.111913  2.336995  0.149520  three

In [57]:
# Search the specific value of cell(s) and display complete rows corresponding to that value
df2[df2["E"].isin(["two", "four"])]
# This is actually a search machanism which will free us from exausted search in a dataset

                   A         B         C         D     E
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742   two
2013-01-05 -0.305415 -0.306567 -0.788328  0.246994  four

#### 4e. Setting

In [58]:
# Creating a dataframe with serial number of data column
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20231001", periods=6))
# Here keep in mind periods range and series range must be same, like series list is 6 & periods=6
s1

2023-10-01    1
2023-10-02    2
2023-10-03    3
2023-10-04    4
2023-10-05    5
2023-10-06    6
Freq: D, dtype: int64

In [59]:
# Set the value of cell explicitly, i,e column A of index=0 (means A1 cell)
df.at[dates[0], "A"] = 0
df.head()
# This will change the value A1 cell to zero
# Here 'at' is used for setting the value by lable

                   A         B         C         D
2013-01-01  0.000000 -0.758804  1.448193 -0.348777
2013-01-02 -0.282346  1.356334  0.223743 -0.327886
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742
2013-01-04  1.729692 -1.127116  1.765678  0.072982
2013-01-05 -0.305415 -0.306567 -0.788328  0.246994

In [60]:
# Same result as above, but Here 'iat' is used for setting the value by position
df.iat[0, 1] = 0
df.head()

                   A         B         C         D
2013-01-01  0.000000  0.000000  1.448193 -0.348777
2013-01-02 -0.282346  1.356334  0.223743 -0.327886
2013-01-03 -0.061196 -0.293378 -1.521073 -0.148742
2013-01-04  1.729692 -1.127116  1.765678  0.072982
2013-01-05 -0.305415 -0.306567 -0.788328  0.246994

In [61]:
# Set/Change the values of specific column with numpy array
df.loc[:, "D"] = np.array([5] * len(df))
df
# Here : means operation will be applied on all rows
# Here len(df) means 'count of all rows in datafram' i,e 6 here

                   A         B         C    D
2013-01-01  0.000000  0.000000  1.448193  5.0
2013-01-02 -0.282346  1.356334  0.223743  5.0
2013-01-03 -0.061196 -0.293378 -1.521073  5.0
2013-01-04  1.729692 -1.127116  1.765678  5.0
2013-01-05 -0.305415 -0.306567 -0.788328  5.0
2013-01-06 -1.839390  0.111913  2.336995  5.0

In [62]:
df2 = df.copy() # Create a copy of datafram
# Convert all positive values into negative values in datafram
df2[df2 > 0] = -df2
# Here -df2 replace the values from positive to negative
df2

                   A         B         C    D
2013-01-01  0.000000  0.000000 -1.448193 -5.0
2013-01-02 -0.282346 -1.356334 -0.223743 -5.0
2013-01-03 -0.061196 -0.293378 -1.521073 -5.0
2013-01-04 -1.729692 -1.127116 -1.765678 -5.0
2013-01-05 -0.305415 -0.306567 -0.788328 -5.0
2013-01-06 -1.839390 -0.111913 -2.336995 -5.0

#### 5. Deal With Missing Values

In [63]:
# Create new datafram from previous and reset it to 4 rows and add new column 'E'
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
# The values of First two cells of column E is set to 1 explicitly
df1.loc[dates[0] : dates[1], "E"] = 1
# Here loc[] is used to access the rows of a dataframe
df1

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  1.448193  5.0  1.0
2013-01-02 -0.282346  1.356334  0.223743  5.0  1.0
2013-01-03 -0.061196 -0.293378 -1.521073  5.0  NaN
2013-01-04  1.729692 -1.127116  1.765678  5.0  NaN

In [64]:
# Remove the complete row in datafram which contains null value or missing value
df1.dropna(how="any")
# Here dropna functions use to remove null value's rows
# Here (how='any') parameter means to remove that row(s) which null value(s) in any cell
# If (how='all') that means all cells contain null values

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  1.448193  5.0  1.0
2013-01-02 -0.282346  1.356334  0.223743  5.0  1.0

In [65]:
# All null value's cells fill with 5 in a datafram
df1.fillna(value=5)

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  1.448193  5.0  1.0
2013-01-02 -0.282346  1.356334  0.223743  5.0  1.0
2013-01-03 -0.061196 -0.293378 -1.521073  5.0  5.0
2013-01-04  1.729692 -1.127116  1.765678  5.0  5.0

In [66]:
# Find the missing values in a datafram
pd.isna(df1)
# Here 'True=Null Value Found' & 'Flase=Null Value Not Found'

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

#### 6a. Operations (Stats)

In [67]:
df

                   A         B         C    D
2013-01-01  0.000000  0.000000  1.448193  5.0
2013-01-02 -0.282346  1.356334  0.223743  5.0
2013-01-03 -0.061196 -0.293378 -1.521073  5.0
2013-01-04  1.729692 -1.127116  1.765678  5.0
2013-01-05 -0.305415 -0.306567 -0.788328  5.0
2013-01-06 -1.839390  0.111913  2.336995  5.0

In [68]:
df.mean() # average

A   -0.126442
B   -0.043136
C    0.577535
D    5.000000
dtype: float64

In [69]:
# Calculate the means of each row
df.mean(axis=1)
# When we use axis=0 that the mean of each column

2013-01-01    1.612048
2013-01-02    1.574433
2013-01-03    0.781088
2013-01-04    1.842063
2013-01-05    0.899923
2013-01-06    1.402380
Freq: D, dtype: float64

In [70]:
# Creating a series from list and indexes
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s
# Here list & index must have same range (i,e 6)
# Here shift(2) means, putting the values from series will be started after 2 rows gap
# Here s means series

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [71]:
df

                   A         B         C    D
2013-01-01  0.000000  0.000000  1.448193  5.0
2013-01-02 -0.282346  1.356334  0.223743  5.0
2013-01-03 -0.061196 -0.293378 -1.521073  5.0
2013-01-04  1.729692 -1.127116  1.765678  5.0
2013-01-05 -0.305415 -0.306567 -0.788328  5.0
2013-01-06 -1.839390  0.111913  2.336995  5.0

In [80]:
# This means subtract a series element from every cell's value of 'df' datafram corresponding to index
# First two rows will be null becuase of above series code
df.sub(s, axis="index")

# For example, results will be
# A3 = -0.061196-1 = -1.061196
# B3 = -0.293378-1 = -1.293378
# C3 = -1.521073-1 = -2.521073
# D3 = 5-1 = 4    and so on

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.061196 -1.293378 -2.521073  4.0
2013-01-04 -1.270308 -4.127116 -1.234322  2.0
2013-01-05 -5.305415 -5.306567 -5.788328  0.0
2013-01-06       NaN       NaN       NaN  NaN

#### 6b. Operations (User defined functions)

In [81]:
# Here 'lambda' is a inline function where can write complete function in single line of code
df.agg(lambda x: np.mean(x) * 5.6)
# Let's eleborate
# Define an agg function in which pass a datafram (named here x) than calculate the mean of x and than multiply it with 5.6
# Here : means, the statements of right side of : apply to the left side's object

A    -0.708078
B    -0.241560
C     3.234194
D    28.000000
dtype: float64

In [79]:
# Every element (cell) of 'df' dataframe is multiplied by 101.2
df.transform(lambda x: x * 101.2)

                     A           B           C      D
2013-01-01    0.000000    0.000000  146.557134  506.0
2013-01-02  -28.573458  137.260972   22.642820  506.0
2013-01-03   -6.193013  -29.689895 -153.932612  506.0
2013-01-04  175.044792 -114.064118  178.686582  506.0
2013-01-05  -30.907954  -31.024540  -79.778784  506.0
2013-01-06 -186.146236   11.325585  236.503906  506.0